app/Http/Controllers/GaleryController.php

    public function index()
    {
        $albumes = Album::all();
---
select * from `albums`