app/Http/Controllers/LandingController.php

    public function index()
    {
        $header = Page::where('name', 'index')->where('section', 'header')->first();
        $models = Model::all();
        $services = Page::where('name', 'amavita')->where('section', 'services')->first();
        $albumes = Album::all();
---
select * from `pages` where `name` = 'index' and `section` = 'header' limit 1
select * from `models`
select * from `pages` where `name` = 'amavita' and `section` = 'services' limit 1
select * from `albums`