app/Http/Controllers/ModelController.php

select * from `models`
---
    public function index()
    {
        $models = Model::all();

select * from `models`
---
    public function show(Model $model)
    {
        $models = Model::all();